SaitovSP/src/DataProcessors/АРМПовар/АРМПовар.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АРМПовар</name>
</mdclass:DataProcessor>

SaitovSP/src/Documents/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказы</name>
  <registerRecords>InformationRegister.ИсторияОтказовОтБлюд</registerRecords>
  <registerRecords>InformationRegister.РезервСтолов</registerRecords>
  <registerRecords>AccumulationRegister.СуммаЗаказовКлиенты</registerRecords>
  <registerRecords>AccumulationRegister.КоличествоЗаказовАкция</registerRecords>
  <attributes>
    <name>Официант</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтола</name>
    <type>
      <types>CatalogRef.Столы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкидочнаяКарта</name>
    <type>
      <types>CatalogRef.СкидочныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаСертификатом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатОплаты</name>
    <type>
      <types>CatalogRef.Сертификаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Резерв</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРезерва</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ГотовДляДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>EnumRef.СтатусЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеУспешнойДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыдачиЗаказаКурьеру</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Блюда</name>
    <attributes>
      <name>Блюдо</name>
      <type>
        <types>CatalogRef.Блюда</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыБлюда</types>
      </type>
    </attributes>
    <attributes>
      <name>Повар</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.ПричиныОтказаОтБлюд</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SaitovSP/src/Documents/РасходПродуктов/РасходПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходПродуктов</name>
  <registerRecords>AccumulationRegister.ПродуктыРесторана</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказы</types>
    </type>
  </attributes>
  <attributes>
    <name>Повар</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ингридиенты</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураИнгридиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.УчетнаяЕдиница</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SaitovSP/src/Catalogs/Блюда/Блюда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Блюда</name>
  <predefined>
    <items>
      <name>Сертификат</name>
      <description>Сертификат</description>
    </items>
  </predefined>
  <attributes>
    <name>ВесГотовогоБлюда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Калорийность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделМеню</name>
    <type>
      <types>EnumRef.РазделыМеню</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПриготовленияМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзменрения</name>
    <type>
      <types>CatalogRef.УчетнаяЕдиница</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ингридиенты</name>
    <attributes>
      <name>Ингридиент</name>
      <type>
        <types>CatalogRef.НоменклатураИнгридиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.УчетнаяЕдиница</types>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SaitovSP/src/DataProcessors/АРМПовар/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	ТекущийПовар = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();
	
	ПодключитьОбработчикОжидания("Обновить", 10);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&Наклиенте
Процедура Обновить()
	ДинамическоеОбновлениеСписка();
КонецПроцедуры

&НаСервере
Процедура ДинамическоеОбновлениеСписка()
	

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(ТекущаяДата()));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заказы.НомерСтола КАК НомерСтола,
	|	ЗаказыБлюда.Блюдо КАК Блюдо,
	|	Заказы.Официант КАК Официант,
	|	ЗаказыБлюда.Статус КАК Статус,
	|	Заказы.Дата КАК Дата,
	|	ЗаказыБлюда.Количество КАК Количество,
	|	Заказы.Ссылка КАК СсылкаЗаказ,
	|	ЗаказыБлюда.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗаказыБлюда.Повар КАК Повар
	|ИЗ
	|	Документ.Заказы.Блюда КАК ЗаказыБлюда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заказы КАК Заказы
	|		ПО ЗаказыБлюда.Ссылка = Заказы.Ссылка
	|ГДЕ
	|	Заказы.Дата МЕЖДУ &НачПериода И &КонПериода
	|	И НЕ Заказы.ЗаказЗакрыт
	|	И НЕ Заказы.Резерв
	|	И ЗаказыБлюда.Блюдо <> ЗНАЧЕНИЕ(Справочник.Блюда.Сертификат)
	|	И Заказы.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Статус,
	|	НомерСтола";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	СостояниеБлюд.Очистить();
	
	
	Пока Выборка.Следующий() Цикл
		
		//Для каждого ТекущаяСтрокаТЗ Из СостояниеБлюд Цикл
		//	
		//	Если Выборка.ИдентификаторСтроки = ТекущаяСтрокаТЗ.ИдентификаторСтроки Тогда
		//		
		//		ТекущаяСтрокаТЗ.Статус = Выборка.Статус;
		//		Прервать;
		//		
		//	КонецЕсли;
		//	
		//				
		//КонецЦикла;
		//
		
		
		СтрокаТЗ = СостояниеБлюд.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ,Выборка);
		
		
		
		
		
		
		
	КонецЦикла;
	
	
КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(ТекущаяДата()));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заказы.НомерСтола КАК НомерСтола,
	|	ЗаказыБлюда.Блюдо КАК Блюдо,
	|	Заказы.Официант КАК Официант,
	|	ЗаказыБлюда.Статус КАК Статус,
	|	Заказы.Дата КАК Дата,
	|	ЗаказыБлюда.Количество КАК Количество,
	|	Заказы.Ссылка КАК СсылкаЗаказ,
	|	ЗаказыБлюда.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗаказыБлюда.Повар КАК Повар
	|ИЗ
	|	Документ.Заказы.Блюда КАК ЗаказыБлюда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заказы КАК Заказы
	|		ПО ЗаказыБлюда.Ссылка = Заказы.Ссылка
	|ГДЕ
	|	Заказы.Дата МЕЖДУ &НачПериода И &КонПериода
	|	И НЕ Заказы.ЗаказЗакрыт
	|	И НЕ Заказы.Резерв
	|	И ЗаказыБлюда.Блюдо <> ЗНАЧЕНИЕ(Справочник.Блюда.Сертификат)
	|	И Заказы.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Статус,
	|	НомерСтола";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	СостояниеБлюд.Очистить();
	
	ЕстьСтрокаВТаблице = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТЗ = СостояниеБлюд.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ,Выборка);
		ЕстьСтрокаВТаблице = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Готовлю(Команда)
	
	ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Повар = ТекущийПовар;
	ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Статус = ОбщийСервер.СтатусЗаказа("Готовиться");
	///Создание структуры для Записи в документ изменений
	СтруктураЗаказа = Новый Структура;
	СтруктураЗаказа.Вставить("Ссылка",ТекущийЭлемент.ТекущиеДанные.СсылкаЗаказ);
	СтруктураЗаказа.Вставить("ИдентификаторСтроки",ТекущийЭлемент.ТекущиеДанные.ИдентификаторСтроки);
	СтруктураЗаказа.Вставить("Повар",ТекущийПовар);
	СтруктураЗаказа.Вставить("Статус",ТекущийЭлемент.ТекущиеДанные.Статус);
	//Вызоа процедуры изменения заказа
	ЗаписьИзмененийВдокументе(СтруктураЗаказа);
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	Если ТекущийЭлемент.ТекущиеДанные.Повар = ТекущийПовар Тогда
		
		ТекущийЭлемент.ТекущиеДанные.Статус = ОбщийСервер.СтатусЗаказа("Готово");
		НомерСтола = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.НомерСтола;
		СтруктураЗаказа = Новый Структура;
		СтруктураЗаказа.Вставить("Ссылка",ТекущийЭлемент.ТекущиеДанные.СсылкаЗаказ);
		СтруктураЗаказа.Вставить("ИдентификаторСтроки",ТекущийЭлемент.ТекущиеДанные.ИдентификаторСтроки);
		СтруктураЗаказа.Вставить("Повар",ТекущийЭлемент.ТекущиеДанные.Повар);
		СтруктураЗаказа.Вставить("Статус",ТекущийЭлемент.ТекущиеДанные.Статус);
		ЗаписьИзмененийВдокументе(СтруктураЗаказа);
		
		СписаниеПродуктов(ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Количество, ТекущийЭлемент.ТекущиеДанные.СсылкаЗаказ, ТекущийЭлемент.ТекущиеДанные.ИдентификаторСтроки)
		
		
	ИначеЕсли ЗначениеЗаполнено(ТекущийЭлемент.ТекущиеДанные.Повар) Тогда
		
		Сообщить("Этот заказ готовить повар " + ТекущийЭлемент.ТекущиеДанные.Повар);
		
	Иначе
		
		Сообщить("Необходимо сначала взять в работу!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписаниеПродуктов(Количество, Ссылка, ИдинтификаторСтроки)
	
	Документы.РасходПродуктов.СозданиеДокументаЗаказ(Количество, Ссылка, ИдинтификаторСтроки)

	
	
//		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
//	// Данный фрагмент построен конструктором.
//	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ИсторияИзмененийРепцетурыБлюдСрезПоследних.Ингридиент КАК Ингридиент,
//		|	ИсторияИзмененийРепцетурыБлюдСрезПоследних.Количество КАК Количество,
//		|	ИсторияИзмененийРепцетурыБлюдСрезПоследних.ЕдИзм КАК ЕдИзм
//		|ИЗ
//		|	РегистрСведений.ИсторияИзмененийРепцетурыБлюд.СрезПоследних(
//		|			,
//		|			Блюдо В
//		|				(ВЫБРАТЬ
//		|					ЗаказыБлюда.Блюдо КАК Блюдо
//		|				ИЗ
//		|					Документ.Заказы.Блюда КАК ЗаказыБлюда
//		|				ГДЕ
//		|					ЗаказыБлюда.Ссылка = &Ссылка
//		|					И ЗаказыБлюда.ИдентификаторСтроки = &ИдентификаторСтроки)) КАК ИсторияИзмененийРепцетурыБлюдСрезПоследних";
//	
//	Запрос.УстановитьПараметр("ИдентификаторСтроки", ИдинтификаторСтроки);
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		// Вставить обработку выборки ВыборкаДетальныеЗаписи
//	КонецЦикла;
//	


КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаписьИзмененийВдокументе(СтруктураЗаказа)
	Документы.Заказы.РедактированиеДокументаПоваром(СтруктураЗаказа);
КонецПроцедуры


#КонецОбласти
